# Part 11

In [3]:
import pandas as pd
import numpy as np

# Persiapan Data Frame

In [5]:
n_rows = 10
n_cols = 5
columns = tuple('ABCDE')

df = pd.DataFrame(np.random.randint(1,20,size=(n_rows,n_cols)),columns=columns)
df

    A   B   C   D   E
0  16  18   3   2  14
1  11  10   7   3   4
2  12   8   8   1  10
3  15  12   7  11  17
4  16  17  16  13   7
5   9   3  15   2   6
6  13  18  11   1  14
7  18   5  13   6  18
8   8  19   7   2   1
9   9  12   1  17   4

# Seleksi Kolom Dan Baris Menggunakan loc

In [8]:
df.loc[[0,3,4],['B','E']]

    B   E
0  18  14
3  12  17
4  17   7

# Seleksi Baris Dengan Kondisi

In [9]:
df.loc[df['B']>10,['B','D','E']]

    B   D   E
0  18   2  14
3  12  11  17
4  17  13   7
6  18   1  14
8  19   2   1
9  12  17   4

# Slicing Data Frame Menggunakan Loc

In [11]:
df.loc[0:4,'B':'D']

    B   C   D
0  18   3   2
1  10   7   3
2   8   8   1
3  12   7  11
4  17  16  13